In [1]:
import numpy as np
import pandas as pd

In [2]:
housing_df = pd.read_csv("./datasets/dmba/WestRoxbury.csv")
housing_df.shape

(5802, 14)

## Perform HID

- head()
- info()
- describe()

In [3]:
housing_df.head()

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2,0,1,0,None

In [4]:
# NOTE: Head only returns the top 5 rows by default. If your sample data is already highly ordered (top 5 belongs to the same group)
# using, .sample(5) might be a better option to explore the data
housing_df.sample(5)

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE,REMODEL
4234,710.1,8933,10981,1910,4808,2694,2.0,10,6,2,1,1,1,None
381,348.3,4381,5441,1960,2416,1726,1.0,8,4,2,0,1,1,Recent
1448,334.5,4208,5652,1961,2643,1155,1.0,6,2,1,1,1,1,None
4145,391.1,4920,6903,1923,3177,1466,1.5,6,3,1,1,1,1,Recent
1275,377.2,4745,6000,1985,2548,1400,2.0,7,3,1,1,1,1,None

In [5]:
housing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5802 entries, 0 to 5801
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   TOTAL VALUE   5802 non-null   float64
 1   TAX           5802 non-null   int64
 2   LOT SQFT      5802 non-null   int64
 3   YR BUILT      5802 non-null   int64
 4   GROSS AREA    5802 non-null   int64
 5   LIVING AREA   5802 non-null   int64
 6   FLOORS        5802 non-null   float64
 7   ROOMS         5802 non-null   int64
 8   BEDROOMS      5802 non-null   int64
 9   FULL BATH     5802 non-null   int64
 10  HALF BATH     5802 non-null   int64
 11  KITCHEN       5802 non-null   int64
 12  FIREPLACE     5802 non-null   int64
 13  REMODEL       5802 non-null   object
dtypes: float64(2), int64(11), object(1)
memory usage: 634.7+ KB

In [6]:
housing_df.describe()

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE
count,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.00000,5802.000000
mean,392.685715,4939.485867,6278.083764,1936.744916,2924.842123,1657.065322,1.683730,6.994829,3.230093,1.296794,0.613926,1.01534,0.739917
std,99.177414,1247.649118,2669.707974,35.989910,883.984726,540.456726,0.444884,1.437657,0.846607,0.522040,0.533839,0.12291,0.565108
min,105.000000,1320.000000,997.000000,0.000000,821.000000,504.000000,1.000000,3.000000,1.000000,1.000000,0.000000,1.00000,0.000000
25%,325.125000,4089.500000,4772.000000,1920.000000,2347.000000,1308.000000,1.000000,6.000000,3.000000,1.000000,0.000000,1.00000,0.000000
50%,375.900000,4728.000000,5683.000000,1935.000000,2700.000000,1548.500000,2.000000,7.000000,3.000000,1.000000,1.000000,1.00000,1.000000
75%,438.775000,5519.500000,7022.250000,1955.000000,3239.000000,1873.750000,2.000000,8.000000,4.000000,2.000000,1.000000,1.00000,1.000000
max,1217.800000,15319.000000,46411.000000,2011.000000,8154.000000,5289.000000,3.000000,14.000000,9.000000,5.000000,3.000000,2.00000,4.000000

In [7]:
# For better readability, use .T aka transpose method
housing_df.iloc[:5].T

                  0       1      2      3      4
TOTAL VALUE   344.2   412.6  330.1  498.6  331.5
TAX            4330    5190   4152   6272   4170
LOT SQFT       9965    6590   7500  13773   5000
YR BUILT       1880    1945   1890   1957   1910
GROSS AREA     2436    3108   2294   5032   2370
LIVING AREA    1352    1976   1371   2608   1438
FLOORS          2.0     2.0    2.0    1.0    2.0
ROOMS             6      10      8      9      7
BEDROOMS          3       4      4      5      3
FULL BATH         1       2      1      1      2
HALF BATH         1       1      1      1      0
KITCHEN           1       1      1      1      1
FIREPLACE         0       0      0      1      0
REMODEL        None  Recent   None   None   None

In [8]:
# Rename columns: replace spaces with '_' to allow dot notation.
housing_df.columns = [s.strip().replace(" ", "_").lower() for s in housing_df.columns]
housing_df.head()

,total_value,tax,lot_sqft,yr_built,gross_area,living_area,floors,rooms,bedrooms,full_bath,half_bath,kitchen,fireplace,remodel
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2,0,1,0,None

In [9]:
housing_df.iloc[:10].total_value

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: total_value, dtype: float64

In [10]:
# 0=rows, 1=columns
# Concatenate the columns
pd.concat([housing_df.iloc[4:6, 0:2], housing_df.iloc[4:6, 4:6]], axis=1)

   total_value   tax  gross_area  living_area
4        331.5  4170        2370         1438
5        337.4  4244        2124         1060

In [11]:
housing_df.total_value[:10]

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: total_value, dtype: float64

In [12]:
print("Number of rows", len(housing_df.total_value))

Number of rows 5802

In [13]:
print("Mean of TOTAL_VALUE", housing_df.total_value.mean())

Mean of TOTAL_VALUE 392.6857149258877

## Sampling from the database

In [14]:
# Oversample houses with over 10 rooms
weights = [0.9 if rooms > 10 else 0.01 for rooms in housing_df.rooms]

housing_df.sample(5, weights=weights)

,total_value,tax,lot_sqft,yr_built,gross_area,living_area,floors,rooms,bedrooms,full_bath,half_bath,kitchen,fireplace,remodel
5656,555.8,6991,7235,1949,4221,2484,1.0,13,4,2,1,2,1,Recent
3058,740.6,9316,16576,1920,7187,4288,2.0,14,8,3,0,1,2,None
3834,750.6,9442,9795,1870,5212,3116,2.0,11,7,1,1,1,0,Recent
350,320.9,4036,8088,1967,2240,1726,1.0,8,3,2,0,1,0,None
4194,466.0,5862,5000,1957,2340,1908,2.0,11,3,2,1,1,1,None

## Preprocessing and Cleaning of Data

### Types of Variables

In [15]:
housing_df.columns

Index(['total_value', 'tax', 'lot_sqft', 'yr_built', 'gross_area',
       'living_area', 'floors', 'rooms', 'bedrooms', 'full_bath', 'half_bath',
       'kitchen', 'fireplace', 'remodel'],
      dtype='object')

In [16]:
housing_df.remodel.describe(), housing_df.remodel.unique()

(count     5802
 unique       3
 top       None
 freq      4346
 Name: remodel, dtype: object,
 array(['None', 'Recent', 'Old'], dtype=object))

In [17]:
# REMODEL needs to be converted from object to a categorical variable.
housing_df.remodel = housing_df.remodel.astype("category")

# Show number of categories
housing_df.remodel.cat.categories

Index(['None', 'Old', 'Recent'], dtype='object')

In [19]:
housing_df.remodel.dtype

CategoricalDtype(categories=['None', 'Old', 'Recent'], ordered=False)

### Handling Categorical Variables

In [20]:
# Creating dummy variables in pandas
# Use drop_first=True to drop the first dummy variable
housing_df = pd.get_dummies(housing_df, prefix_sep="_", drop_first=True)
housing_df.columns

Index(['total_value', 'tax', 'lot_sqft', 'yr_built', 'gross_area',
       'living_area', 'floors', 'rooms', 'bedrooms', 'full_bath', 'half_bath',
       'kitchen', 'fireplace', 'remodel_Old', 'remodel_Recent'],
      dtype='object')

In [21]:
housing_df.loc[:, "remodel_Old":"remodel_Recent"].head(5)

   remodel_Old  remodel_Recent
0            0               0
1            0               1
2            0               0
3            0               0
4            0               0

In [22]:
# Missing data: code for imputing missing data with median.

missing_rows = housing_df.sample(10).index
print(
    "Number of rows with valid BEDROOMS values after setting to NAN:",
    housing_df["bedrooms"].count(),
)
housing_df.loc[missing_rows, "bedrooms"] = np.nan

Number of rows with valid BEDROOMS values after setting to NAN: 5802

In [23]:
# Remove rows with missing values
reduced_df = housing_df.dropna()
print(
    "Number of rows after removing rows with missing values:",
    len(reduced_df),
)

Number of rows after removing rows with missing values: 5792

In [24]:
median_bedrooms = housing_df["bedrooms"].median()
median_bedrooms

3.0

In [25]:
# Replace the missing values using the median of the remaining values.
housing_df.bedrooms = housing_df.bedrooms.fillna(value=median_bedrooms)
print(
    "Number of rows with valid bedroom values after filling NA values:",
    housing_df.bedrooms.count(),
)

Number of rows with valid bedroom values after filling NA values: 5802